from matplotlib import pyplot as plt
from utilites import load, dump, compare
from PIL import Image
import matplotlib.pyplot as plt
import numpy as np

data = {
  "сельское, лесное хозяйство, охота, рыболовство и рыбоводство": {
    "Тыва": 0.37382352941176467,
    "Карачаево-Черкессия": 0.5199459188224799,
    "Ингушетия": 0.627624511385691,
    "Калмыкия": 0.5589864800983265,
    "Чечня": 0.5008320924936498,
    "Кабардино-Балкарская": 0.4189534732902221,
    "Алтай": 0.5886133216437371,
    "Дагестан": 0.399405452731456,
    "Крым": 0.6299118910752284,
    "Татарстан": 0.5021858592551514,
    "Адыгея": 0.6855718292302897
  },
  "добыча полезных ископаемых": {
    "Тыва": 0.45730837789661316,
    "Карачаево-Черкессия": 0.41052631578947363,
    "Ингушетия": 0.5277958300927948,
    "Калмыкия": 0.605081255974704,
    "Чечня": 0.6893521357040671,
    "Кабардино-Балкарская": 0.29923428264373986,
    "Алтай": 0.6697464256811438,
    "Дагестан": 0.49192338756201687,
    "Крым": 0.665513961166135,
    "Татарстан": 0.5565018409552321,
    "Адыгея": 0.6599467842845843
  },
  "обрабатывающие производства": {
    "Тыва": 0.5170685665570576,
    "Карачаево-Черкессия": 0.3972494796312816,
    "Ингушетия": 0.5624933233628886,
    "Калмыкия": 0.4679020516214427,
    "Чечня": 0.5880299957553177,
    "Кабардино-Балкарская": 0.4618162278344976,
    "Алтай": 0.4720205017534395,
    "Дагестан": 0.5645984769816546,
    "Крым": 0.5352469726735296,
    "Татарстан": 0.6033042565637796,
    "Адыгея": 0.4815088079482339
  },
  "обеспечение электрической энергией, газом и паром; кондиционирование воздуха": {
    "Тыва": 0.5203781512605041,
    "Карачаево-Черкессия": 0.9298245614035088,
    "Ингушетия": 0.8404802744425387,
    "Калмыкия": 0.4844749613942202,
    "Чечня": 0.7060523780327582,
    "Кабардино-Балкарская": 0.3807092960773777,
    "Алтай": 0.6553817102778527,
    "Крым": 0.10311398354876611,
    "Татарстан": 0.6488420907745777,
    "Адыгея": 0.2170977459229251,
    "Дагестан": 0.0,
  },
  "строительство": {
    "Тыва": 0.5139437170216924,
    "Карачаево-Черкессия": 0.6058184201423656,
    "Ингушетия": 0.538372734730405,
    "Калмыкия": 0.5494762545927566,
    "Чечня": 0.5071822720504511,
    "Кабардино-Балкарская": 0.6375604513702312,
    "Алтай": 0.6978329286934628,
    "Дагестан": 0.8476116303219107,
    "Крым": 0.5264409055860787,
    "Татарстан": 0.48625592145257684,
    "Адыгея": 0.5553586267788512
  },
  "транспортировка и хранение": {
    "Тыва": 0.5043467386954782,
    "Карачаево-Черкессия": 0.5583804143126176,
    "Ингушетия": 0.5984590082858725,
    "Калмыкия": 0.6965034193690712,
    "Чечня": 0.7274427858206435,
    "Кабардино-Балкарская": 0.631416801003045,
    "Алтай": 0.590202576849461,
    "Дагестан": 0.36028902734510204,
    "Крым": 0.509433837237041,
    "Татарстан": 0.43585755898761674,
    "Адыгея": 0.5323069731764029
  },
  "деятельность в области информации и связи": {
    "Тыва": 0.6351365546218488,
    "Карачаево-Черкессия": 0.591282894736842,
    "Ингушетия": 0.508139309419047,
    "Калмыкия": 0.5519854401058901,
    "Чечня": 0.4921462147090596,
    "Кабардино-Балкарская": 0.38010124720721744,
    "Алтай": 0.6252728253672413,
    "Дагестан": 0.45327102803738323,
    "Крым": 0.715938585503803,
    "Татарстан": 0.565183801369977,
    "Адыгея": 0.7702104279083498
  },
  "деятельность профессиональная, научная и техническая": {
    "Тыва": 0.723342670401494,
    "Карачаево-Черкессия": 0.4434730895034195,
    "Ингушетия": 0.8052137453285937,
    "Калмыкия": 0.5289937285304592,
    "Чечня": 0.6889850974111288,
    "Кабардино-Балкарская": 0.7512090274046213,
    "Алтай": 0.8230824566136139,
    "Дагестан": 0.5437867774316373,
    "Крым": 0.5601573179212931,
    "Татарстан": 0.5198100547125012,
    "Адыгея": 0.7485003116235587
  },
  "государственное управление и обеспечение военной безопасности; социальное обеспечение": {
    "Тыва": 0.5186741363211952,
    "Карачаево-Черкессия": 0.6418822479928635,
    "Ингушетия": 0.5816259771252686,
    "Калмыкия": 0.5225257831458195,
    "Чечня": 0.5103251601069613,
    "Кабардино-Балкарская": 0.48735446892351786,
    "Алтай": 0.6327218775289992,
    "Дагестан": 0.6504295289342018,
    "Крым": 0.5458775697375908,
    "Татарстан": 0.5331268710643129,
    "Адыгея": 0.5119641187730936
  },
  "образование": {
    "Тыва": 0.6727845683728039,
    "Карачаево-Черкессия": 0.42891598110152973,
    "Ингушетия": 0.6802713566030022,
    "Калмыкия": 0.7459338587730382,
    "Чечня": 0.5957951781016989,
    "Кабардино-Балкарская": 0.6911606663084363,
    "Алтай": 0.6336442823951199,
    "Дагестан": 0.5410176531671859,
    "Крым": 0.5093676398024224,
    "Татарстан": 0.662637702959784,
    "Адыгея": 0.5831221970815778
  },
  "деятельность в области здравоохранения и социальных услуг": {
    "Тыва": 0.5860840336134454,
    "Карачаево-Черкессия": 0.5569432054713054,
    "Ингушетия": 0.7145014542471475,
    "Калмыкия": 0.6004130628266279,
    "Чечня": 0.7242189198044501,
    "Кабардино-Балкарская": 0.7997147935353203,
    "Алтай": 0.5699781739706206,
    "Дагестан": 0.4974616360909196,
    "Крым": 0.5976812316223256,
    "Татарстан": 0.5601355768899902,
    "Адыгея": 0.618741560195284
  },
  "деятельность в области культуры, спорта, организации досуга и развлечений": {
    "Тыва": 0.47090654443595614,
    "Карачаево-Черкессия": 0.42969712416634803,
    "Ингушетия": 0.5853966241579039,
    "Калмыкия": 0.6374196066452851,
    "Чечня": 0.5635806253832005,
    "Кабардино-Балкарская": 0.3213326168726491,
    "Алтай": 0.6878428198902975,
    "Дагестан": 0.5463086584581911,
    "Крым": 0.6174720916568743,
    "Татарстан": 0.6919066790544027,
    "Адыгея": 0.688921782486756
  }
}

rotated = {}

industries = list(data.keys())
regions = data[industries[0]].keys()

for region in regions:
    rotated.update({region:{}})
    for industry in industries:
        v = data[industry][region]
        rotated[region].update({industry:int(v*100)})
        
        
ind_colors = {}

for industry in industries:
    c = tuple(np.array(Image.open('icons/%s.png' % industry).getpixel((0,0))) / 255)
    ind_colors.update({industry:c})
    
percents = {}
j = 1
for region in regions:
    labels = []
    sizes  = []
    colors = []
    i = 0
    for industry in industries:
        colors += [ind_colors[industry]]
        sizes  += [rotated[region][industry]]
        i += 1
    sumsizes = sum(sizes)
    for industry in industries:
        percents.update({(region, industry):rotated[region][industry] * 100 / sumsizes})
    
    j += 1
#    plt.figure(figsize=(16,9), dpi=75)
#    squarify.plot(sizes=sizes, label=labels, color=colors, text_kwargs={'fontsize':18})
#    region = region.title() if "республика" in region else region.capitalize()
    
#    plt.title(region, fontdict={'fontsize':24})
#    plt.axis('off')
#    plt.savefig("/tmp/%s.png" % region)
#    plt.close()
    
    img = Image.new('RGBA', (1000, 1000), (255, 255, 255, 255))
    x, y = (20, 20)
    n = 0
    for icon, key in [ (Image.open('icons/%s.png' % x), x) for x in industries]:
        icon = icon.resize((24,24))
        v = percents[(region, key)]
        for i in range(round(v*10.24)):
            img.paste(icon, (x, y))
            n += 1
            x += 30
            if x > 950:
                x = 20
                y += 30
            if n > 1023: break
    for i in range(n, 1024):
        img.paste(icon, (x, y))
        x += 30
        if x > 950:
            x = 20
            y += 30
    
    img.save("/tmp/%s.png" % region)